-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Nov 04, 2025 at 09:43 PM
-- Server version: 8.0.30
-- PHP Version: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `shenava_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `app_settings`
--

CREATE TABLE `app_settings` (
  `id` int NOT NULL,
  `setting_key` varchar(100) COLLATE utf8mb4_persian_ci NOT NULL,
  `setting_value` text COLLATE utf8mb4_persian_ci,
  `setting_type` enum('string','integer','boolean','json') COLLATE utf8mb4_persian_ci DEFAULT 'string',
  `description` text COLLATE utf8mb4_persian_ci,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `app_settings`
--

INSERT INTO `app_settings` (`id`, `setting_key`, `setting_value`, `setting_type`, `description`, `created_at`, `updated_at`) VALUES
(1, 'app_name', 'شنوا', 'string', NULL, '2025-11-04 16:54:19', '2025-11-04 16:54:19'),
(2, 'app_description', 'نرم افزار شنوا مرجع انواع پادکست ها و کتاب صوتی های رایگان', 'string', NULL, '2025-11-04 16:54:19', '2025-11-04 16:54:19'),
(3, 'contact_email', 'namayandeshayan@gmail.com', 'string', NULL, '2025-11-04 16:54:19', '2025-11-04 16:54:19'),
(4, 'items_per_page', '20', 'string', NULL, '2025-11-04 16:54:19', '2025-11-04 16:54:19'),
(5, 'enable_registration', '1', 'string', NULL, '2025-11-04 16:54:19', '2025-11-04 16:54:19'),
(6, 'maintenance_mode', '0', 'string', NULL, '2025-11-04 16:54:19', '2025-11-04 16:54:19'),
(7, 'storage_audio_path', '/assets/audio/', 'string', NULL, '2025-11-04 16:54:26', '2025-11-04 16:54:26'),
(8, 'storage_images_path', '/assets/images/', 'string', NULL, '2025-11-04 16:54:26', '2025-11-04 16:54:26'),
(9, 'storage_max_file_size', '50', 'string', NULL, '2025-11-04 16:54:26', '2025-11-04 16:54:26'),
(10, 'storage_allowed_audio_types', 'mp3,wav,m4a,ogg', 'string', NULL, '2025-11-04 16:54:26', '2025-11-04 16:54:26'),
(11, 'storage_allowed_image_types', 'jpg,jpeg,png,gif,svg,webp', 'string', NULL, '2025-11-04 16:54:26', '2025-11-04 18:55:05');

-- --------------------------------------------------------

--
-- Table structure for table `authors`
--

CREATE TABLE `authors` (
  `id` int NOT NULL,
  `uuid` varchar(36) COLLATE utf8mb4_persian_ci NOT NULL,
  `name` varchar(100) COLLATE utf8mb4_persian_ci NOT NULL,
  `bio` text COLLATE utf8mb4_persian_ci,
  `avatar_url` varchar(255) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `website_url` varchar(255) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `authors`
--

INSERT INTO `authors` (`id`, `uuid`, `name`, `bio`, `avatar_url`, `website_url`, `is_active`, `created_at`) VALUES
(1, '270307c7-7d06-4e5b-a710-7c49de7df334', 'جی کی رولینگ', 'جی.کی رولینگ کیست؟\r\nجی. کی رولینگ- با نام اصلی‌ جوآن رولینگ- را کمتر کسی است که نشناسد، او خالق مجموعه رمان‌های هری پاتر است. او در سال 1965 در بریتانیا متولد شد. جی کی رولینگ شهرتش را با نوشتن مجموعه هری پاتر به دست آورد. کتاب‌هایی که به بیش از 65 زبان دنیا ترجمه‌شده و به‌طور تقریبی در 450 میلیون نسخه منتشرشده است. مجموعه داستان‌های هری پاتر یکی از پرفروش‌ترین کتاب‌های داستانی جهان بوده است به طوری که در سال 2007 ساندی تایمز در فهرست ثروتمندان جهان ثروت رولینگ را حدود ۱٫۰۷ میلیارد دلار تخمین زد و در بین پولدارترین زنان انگلیس او را در رده 13 جدول قرار دارد. نکته قابل توجهی که درباره‌ی رولینگ وجود دارد، نام او در کنار سیاستمداران بزرگ جهان مثل ولادیمیر پوتین است. در سال 2007 مجله تایمز هم نام رولینگ را بعد از ولادیمیر پوتین به‌عنوان دومین شخص تأثیرگذار سال انتخاب کرد. مجله فوربز رولینگ را در رده چهل و هشتمین شخصیت معروف در سال ۲۰۰۷ معرفی کرد. رولینگ در حال حاضر فعالیت‌های انسان دوستانه و خیرخواهانه زیادی را به عهده گرفته و حمایت می‌کند.n>\r\n\r\nکودکی و نوجوانی جی.کی رولینگ\r\nجی کی رولینگ هم مثل بسیاری از نویسندگان دیگر از کودکی به نوشتن علاقه داست. گاهی هم می‌نوشت اما اوایل نوشته‌های خوبی برای ارائه نداشت. او از همین دوره به نام خانوادگی پاتر علاقه‌ی خاصی داشت. داستانی که از کودکی او بسیار مشهور شده است این است که زمانی که رولینگ 6 سال داشت یک داستان کوتاه درباره‌ی یک خرگوش نوشت و نام آن را خرگوشی به نام خرگوش گذاشت. مادر رولینگ بعد از خواندن این داستان از دخترش تعریف کرد و رولینگ در جواب به مادرش گفت «پس بیا چاپش کنیم». رولینگ سال‌ها بعد درباره‌ی این خاطره گفت است که نمی‌دانم این حرف از کجا به ذهنم رسید واقعاً عجیب بود.\r\n\r\nبعد از فارغ‌التحصیلی از مدرسه رولینگ در امتحانات دانشگاه آکسفورد شرکت کرد اما قبول نشد. پدر و مادر رولینگ، او را تشویق کردند تا در دانشگاه اِکستر انگلستان، زبان فرانسه بخواند چرا که زبان فرانسه از نظر آنها پرکاربردتر از انگلیسی بود.\r\n\r\nایده‌ی هری پاتر\r\nسال 1990 بود که اولین ایده‌ی داستان هری پاتر به ذهن رولینگ رسید. طبق گفته‌های رولینگ او زمانی که در یک سفر طولانی که با قطار داشت فکر نوشتن هری پاتر به ذهنش رسید و در همان جا شخصیت‌های این داستان را در ذهنش ساخت.\r\n\r\nاز افسردگی تا موفقیت\r\nموفقیت جی. کی رولینگ به شکلی که ما امروزه می‌بینیم نبوده است او سختی‌های زیادی را در زندگی متحمل شده و از یک ایده‌ی ناب و کار کردن روی آن به این موقعیت رسیده است. رولینگ در سال 1990 بعد از فارغ‌التحصیلی از دانشگاه به‌عنوان منشی و مترجم مشغول به کار شد و بعد از دو سال با یک روزنامه‌نگار ازدواج کرد و حاصل این ازدواج دختری به نام جسیکا بود؛ اما بعد از دو سال رولینگ متوجه شد که همسرش مردی نیست که او در رویاهای خود می‌دیده است. درنهایت در سال 1993 بعد از یک دعوای سخت همسر رولینگ او را از خانه بیرون کرد و سرانجام آن‌ها از هم طلاق گرفتند. این طلاق در روحیه رولینگ تأثیر بدی گذاشت به‌قدری که او را تا مرز خودکشی کشاند. رولینگ که شغل خود را ازدست‌داده بود و با افسردگی دست‌وپنجه نرم می‌کرد سعی کرد با نویسندگی خودش را آرام کند و روی داستان هری پاتر که ایده‌ی آن سه سال قبل در ذهنش شکل‌گرفته بود کار کند.\r\n\r\nانتشار اولین کتاب هری پاتر\r\nرولینگ مدت‌ها به کافه‌ها می‌رفت و آنجا روی داستان خود کار می‌کرد تا سرانجام اولین کتابش را به پایان رساند و برای چندین انتشاراتی فرستاد. در ابتدا حدود دوازده موسسه بزرگ انتشاراتی کتابش را رد کردند؛ اما یک انتشاراتی کوچک قبول کرد با دستمزد 1500 یورو به‌عنوان دستمزد به رولینگ آن را منتشر کند. رولینگ نویسنده‌ای بود که با فقر و مخارج کم اما با امید زیاد به نوشتن ادامه داد. دخترش جسیکا یکی از خوانندگان او بود که داستانش را خوانده بود و مشتاق بود تا بداند انتهای داستان به کجا ختم می‌شود. رولینگ در خاطرات خود گفته است: «به این نتیجه رسیده بودم که تنها کاری که می‌خواهم انجام دهم نوشتن رمان است؛ اما پدر و مادرم که هر دو در خانواده‌های فقیری بزرگ‌شده و هیچ‌کدام به دانشگاه نرفته بودند، می‌گفتند که نیروی تخیلی من یک پدیده عجیب سرگرم‌کننده شخصی است که هرگز به‌جایی نمی‌رسد وزندگی مالی مرا تأمین نمی‌کند؛ اما حرفشان به گوش من نرفت. ازاین‌رو آن‌ها امیدوار بودند که مدرکی حرفه‌ای و کارآمد بگیرم؛ اما من می‌خواستم ادبیات انگلیسی بخوانم.»\r\n\r\nرولینگ اولین کتابش را با نام خودش جوآن رولینگ امضا کرد اما چون جوانان در آن زمان به نویسندگان زن بها نمی‌دادند مدیر انتشارات بلومزبری از او خواست که کتابش را با نام مستعار امضا کند. به همین دلیل از آن به بعد روی کتاب‌های هری پاتر نام جی.کی.رولینگ ثبت شد و این اسم بر کتابهای او باقی ماند. در سال ۱۹۹۶ اولین سری کتاب‌های هری پاتر روانه‌ی بازار شد و در عرض چند هفته تمامی کتاب‌ها فروخته شد. اولین جلد کتاب هری پاتر ۱۲۰ میلیون نسخه بود که به سرعت به زبان‌های مختلف ترجمه و در سراسر دنیا به فروش رفت.\r\n\r\nسال ۱۹۹۸ بود که داستان هری پاتر برای اولین بار تبدیل به فیلم شد و با درخواست رولینگ تمام بازیگران، از بازیگران بریتانیایی انتخاب شدند و در سال 2006 آخرین سری کتاب هری پاتر نوشته و منتشر شد. جی کی رولینگ به غیر از هری پاتر چند کتاب دیگر هم دارد.\r\n\r\nجوایز و افتخارات جی کی رولینگ\r\nاز سال 1997 تا سال 2017 جی کی رولینگ جوایز و افتخارات متعددی کسب کرده است. او بیش از 4 بار موفق شده جایزه کتاب کودک سال بریتانیا را کسب کند. او در سال 2010 جایزه هانس کریستن آندرسن و در سال 2017 جایزه افتخاری خانواده سلطنتی بریتانیا را کسب کرد.\r\n\r\nمجموعه هری پاتر\r\nهری پاتر و سنگ جادو\r\nهری پاتر و تالار اسرار\r\nهری پاتر و زندانی آزکابان\r\nهری پاتر و جام آتش\r\nهری پاتر و محفل ققنوس\r\nهری پاتر و شاهزاده دورگه\r\nهری پاتر و یادگاران مرگ\r\nهری پاتر و فرزند نفرین‌شد', '/assets/images/authors/author_1_1762279021.jpg', 'https://en.wikipedia.org/wiki/J._K._Rowling', 1, '2025-11-04 17:55:28'),
(2, 'a65bc7f0-2387-4982-8167-cb016eef3fa2', 'محمود دولت آبادی', 'محمود دولت‌آبادی یکی از برجسته‌ترین چهره‌های ادبیات معاصر ایران است. نویسنده‌ای با نثری ریشه‌دار، اجتماعی و به‌شدت انسانی که زندگی و رنج طبقات فرودست جامعه، به‌ویژه روستاییان خراسان، را با چیره‌دستی در آثارش بازتاب داده است. او متولد ۱۰ مرداد ۱۳۱۹ در روستای دولت‌آباد سبزوار است و علاوه بر نویسندگی، سابقه بازیگری در تئاتر و سینما را نیز دارد. دولت‌آبادی با رمان حماسی و ده‌جلدی کلیدر به شهرت رسید و از آن زمان تاکنون، به‌عنوان صدای دردمند مردم ایران، نقشی کلیدی در ادبیات داستانی ایفا کرده است.\r\n\r\n\r\nزندگینامه محمود دولت‌آبادی\r\nمحمود دولت‌آبادی در روستای دولت‌آباد سبزوار، در خانواده‌ای ساده و مذهبی به دنیا آمد. پدرش، با وجود نداشتن تحصیلات حوزوی عمیق، او را با دیوان حافظ و سعدی آشنا کرد؛ تجربه‌ای که مسیر زندگی‌اش را برای همیشه تغییر داد. پس از تحصیلات ابتدایی، راهی مشهد شد و از آن‌جا به تهران رفت و وارد دنیای تئاتر شد. داستان‌نویسی را با «ته شب» آغاز کرد. او به‌دلیل فعالیت‌های سیاسی، در دهه ۵۰ به زندان افتاد؛ تجربه‌ای که الهام‌بخش بسیاری از آثار بعدی‌اش شد. دولت‌آبادی با بیش از نیم‌قرن فعالیت ادبی، اکنون یکی از ستون‌های اصلی ادبیات معاصر فارسی به‌شمار می‌آید.\r\n\r\n\r\n\r\nجوایز و افتخارات محمود دولت‌آبادی\r\nمحمود دولت‌آبادی، نویسنده نام‌آشنای ایرانی و خالق آثاری چون کلیدر و زوال کلنل، در طول فعالیت ادبی خود جوایز داخلی و بین‌المللی متعددی را کسب کرده است. از مهم‌ترین افتخارات محمود دولت‌آبادی می‌توان به این موارد اشاره کرد:\r\n\r\n·        دریافت نشان شوالیه هنر و ادب فرانسه (۲۰۱۴)\r\n\r\n·        برنده جایزه ادبی یان میخالسکی در سوییس (۲۰۱۳)\r\n\r\n·        نامزد بهترین کتاب ترجمه سال آمریکا برای زوال کلنل (۲۰۱۳)\r\n\r\n·        نامزد جایزه من بوکر آسیا و جایزه ادبی آسیایی (۲۰۱۱)\r\n\r\n·        برنده جایزه ادبیات بین‌المللی برلین (۲۰۰۹)\r\n\r\nاین افتخارات نشان‌دهنده جایگاه ممتاز دولت‌آبادی در ادبیات معاصر ایران و اعتبار جهانی او هستند.\r\n\r\n\r\n\r\nآثار اقتباسی محمود دولت‌آبادی\r\nتأثیر دولت‌آبادی بر سینما و تلویزیون ایران انکارناپذیر است. شماری از آثار و طرح‌های او الهام‌بخش فیلم‌ها و سریال‌های مطرحی شده‌اند. فیلم خاک به کارگردانی مسعود کیمیایی بر اساس داستان «آوسنه‌ی باباسبحان» ساخته شد، هرچند دولت‌آبادی معتقد بود وفاداری لازم به متن در آن رعایت نشد. فیلم‌های دیگری مانند گوزن‌ها، اتوبوس، مادیان و سریال سربداران نیز از آثار یا طرح‌های دولت‌آبادی الهام گرفته یا به‌طور مستقیم اقتباس شده‌اند. با این حال، بسیاری از این اقتباس‌ها بدون رضایت یا حتی ذکر نام او انجام شده‌اند که باعث دلخوری و انتقاد صریح این نویسنده شده است.\r\n\r\nسبک نوشتاری محمود دولت‌آبادی ریشه در رئالیسم اجتماعی دارد؛ با زبانی غنی، شاعرانه و گاه بومی. او با جزئی‌نگری و نثری پرریتم، رنج و زندگی طبقات فرودست را روایت می‌کند. شخصیت‌ها در آثارش زنده‌اند و با نگاهی عمیق به جامعه، سیاست و تاریخ شکل می‌گیرند. دولت‌آبادی با تلفیق تکنیک‌های مدرن مثل جریان سیال ذهن، داستان‌هایی می‌نویسد که به‌طرز ملموسی واقعی و تأثیرگذارند.\r\n\r\n\r\nبهترین کتاب‌های محمود دولت‌آبادی\r\nدر میان آثار ارزشمند دولت‌آبادی، چند اثر برجسته‌تر و تأثیرگذارتر از دیگران‌اند:\r\n\r\n جای خالی سلوچ\r\nطریق بسمل شدن\r\nسلوک\r\nروز و شب یوسف\r\n\r\n\r\nبهترین کتاب‌های صوتی محمود دولت‌آبادی\r\nدولت‌آبادی با نثر آهنگین و غنای زبانی‌اش، در قالب صوتی نیز به‌خوبی درخشان است. شنیدن آثارش با صدای گویندگان حرفه‌ای، تجربه‌ای متفاوت و عمیق خلق می‌کند. پیشنهاد می‌شود کتاب‌های زیر را به‌صورت صوتی بشنوید:\r\n\r\nکتاب صوتی در یتیم با صدای محمود دولت‌آبادی\r\nکتاب صوتی جای خالی سلوچ با صدای آرمان سلطان‌زاده\r\nمجموعه کامل کتاب صوتی کلیدر با صدای آرمان سلطان‌زاده و جمعی از گویندگان\r\nپای گلدسته امامزاده شعیب(کارنامه سپنج) با صدای بهنام تشکر\r\nکتاب صوتی سلوک با صدای مجتبی شکوری', '/assets/images/authors/author_1762282476.webp', 'https://fa.wikipedia.org/wiki/%D9%85%D8%AD%D9%85%D9%88%D8%AF_%D8%AF%D9%88%D9%84%D8%AA%E2%80%8C%D8%A2%D8%A8%D8%A7%D8%AF%DB%8C', 1, '2025-11-04 18:54:36'),
(3, '6565590b-c7f7-420e-ac7b-ec005f5e1aa8', 'آرمان سلطان زاده', 'آرمان سلطان‌زاده در سال 1366 در شهر بابل به دنیا آمد و تحصیلات خود را در رشته ادبیات فارسی در دانشگاه مازندران به پایان رساند. از سال 1382، با کمک استادانی چون علی محمدی کلاگر و عباس ابوالحسنی، به حرفه تئاتر پیوست و در 30 نمایش تئاتر به عنوان بازیگر فعالیت کرد. مهترین اثر او، بازیگری در فیلم ماه در جنگل به کارگردانی سیامک شایقی بوده است. سلطان زاده همچنین 4 اثر سینمایی را نیز کارگردانی و نویسندگی کرده است.\r\n\r\nاین گوینده مشهور بیشتر به عنوان گوینده کتاب‌های صوتی شناخته می‌شود. آغاز فعالیت او در این زمینه به سال 1388 برمی‌گردد. زمانی که سلطان زاده با علی دنیوی ساروی آشنا شد و به عنوان بازیگر نمایش‌های رادیویی کار خود را در رادیو مازندران آغاز کرد. این آشنایی در واقع نقطه‌ عطف مهمی در زندگی حرفه‌ای او بود. از آن زمان به بعد، او همکاری حرفه‌ای خود را در نمایش‌های رادیویی با علی دنیوی ساروی ادامه داد.\r\n\r\nدر سال 1393 و در دیدار با مؤسس انتشارات صوتی آوانامه، آقای دامون آذری، دنیایی جدید در زندگی آرمان سلطان‌زاده شروع شد. این آشنایی باعث شد تا سلطان زاده به کار تولید کتاب‌های صوتی بپردازد. او از همان سال با نشر صوتی آوانامه به عنوان گوینده شروع به همکاری کند و به مرور زمان به یکی از محبوب‌ترین و پرمخاطب‌ترین گویندگان کتاب‌های صوتی در ایران تبدیل شد.\r\n\r\nگفتنی است تاکنون بیش از 200 کتاب صوتی را برای نشر صوتی آوانامه اجرا کرده و گویندگی کتاب‌های زیادی را در حوزه‌های متنوع از جمله ادبیات، تاریخ، سیاست، روان‌شناسی، موفقیت و خودیاری و حتی فلسفه برای علاقه‌مندان خود به ثبت رسانده است. از مهمترین کتاب‌های صوتی موجود که با آرمان سلطان زاده به بازار معرفی شده است به کتاب‌های صوتی خشم و هیاهو، کتاب صوتی اثر مرکب و کتاب صوتی مزرعه حیونات می‌توان اشاره کرد.\r\n\r\nعلاوه بر گویندگی کتاب‌های صوتی، از سال‌های 1397 تا 1399، آرمان سلطان‌زاده مدیریت تولید نشر صوتی آوانامه را نیز بر عهده گرفت و هم‌اکنون به عنوان «مدیر بخش نمایش‌های صوتی» در این انتشارات فعالیت می‌کند. آرمان سلطان زاده علاوه بر فعالیت‌های حرفه‌ای خود، از سال 1399 به آموزش فن بیان و گویندگی روی آورد و با تجربه و تخصص بالایی که در این زمینه دارد هنرجویان مستعدی را آموزش داده و به بازار کار معرفی کرده است. او همچنین آموزش‌های تخصصی خود را نیز در مدرسه صدای آوانامه در حوزه‌های فن بیان، گویندگی و بازیگری نمایش صوتی ارائه می‌دهد.\r\n\r\n\r\n\r\nمعرفی آثار آرمان سلطان زاده\r\n\r\n\r\n- کتاب صوتی خشم و هیایو: کتاب خشم و هیاهو نوشته‌ ویلیام فاکنر است که در سال 1929 منتشر شد. نسخه صوتی این کتاب را می‌توانید با صدای آرمان سلطان زاده گوش کنید. این کتاب روایت خانواده‌ای است که در گذشته اشراف‌زاده بوده است و به دنبال اتفاقاتی در تلاش برای حفظ اموال و آبروی‌شان هستند.\r\n\r\n- کتاب صوتی اثر مرکب: از دیگر آثار صوتی آرمان سلطان زاده کتاب اثر مرکب نوشته دارن هاردی است. هاردی در این کتاب با بیان 6 اصل مهم و اثربخش به افراد یادآوری می‌کند که لازمه رسیدن به دستاورد‌های بزرگ، دست پیدا کنید.\r\n\r\n- کتاب صوتی مزرعه حیوانات: کتاب صوتی مزرعه حیوانات نوشته جرج ارول از دیگر آثار صوتی معروف آرمان سلطان زاده است. این کتاب داستان گروهی از حیوانات است که انسان‌ها را از محل زندگی خود در مزرعه‌ای بیرون می‌کنند و خود اداره مزرعه را به عهده می‌گیرند.\r\n\r\n- کتاب صوتی وقتی نیچه گریست: این کتاب اثر اروین یالوم است که با صدای دلنشین آرمان سلطان زاده منتشر شده است. نویسنده در این کتاب داستانی خیالی از روزهای جوانی و بیماری فریدریش نیچه را به تصویر می‌کشد.\r\n\r\n- کتاب صوتی چشم هایش: این کتاب مشهورترین اثر بزرگ علوی است که با صدای آرمان سلطان زاده روایت شده است. این کتاب داستان استاد ماکان، نقاش بزرگ و مبارز سیاسی را روایت می‌کند که علیه دیکتاتوری رضاشاه در تبعید به سر می‌برد.', '/assets/images/authors/author_1762290004.webp', 'https://www.instagram.com/arman_soltanzadeh/', 1, '2025-11-04 21:00:04');

-- --------------------------------------------------------

--
-- Table structure for table `bookmarks`
--

CREATE TABLE `bookmarks` (
  `id` int NOT NULL,
  `uuid` varchar(36) COLLATE utf8mb4_persian_ci NOT NULL,
  `user_id` int NOT NULL,
  `chapter_id` int NOT NULL,
  `title` varchar(100) COLLATE utf8mb4_persian_ci NOT NULL,
  `note` text COLLATE utf8mb4_persian_ci,
  `position_seconds` int NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int NOT NULL,
  `uuid` varchar(36) COLLATE utf8mb4_persian_ci NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_persian_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_persian_ci NOT NULL,
  `description` text COLLATE utf8mb4_persian_ci,
  `cover_image` varchar(255) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `duration` int DEFAULT '0',
  `author_id` int DEFAULT NULL,
  `narrator_id` int DEFAULT NULL,
  `category_id` int DEFAULT NULL,
  `price` decimal(10,2) DEFAULT '0.00',
  `is_free` tinyint(1) DEFAULT '0',
  `is_featured` tinyint(1) DEFAULT '0',
  `is_active` tinyint(1) DEFAULT '1',
  `total_views` int DEFAULT '0',
  `average_rating` decimal(3,2) DEFAULT '0.00',
  `published_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `uuid`, `title`, `slug`, `description`, `cover_image`, `duration`, `author_id`, `narrator_id`, `category_id`, `price`, `is_free`, `is_featured`, `is_active`, `total_views`, `average_rating`, `published_at`, `created_at`, `updated_at`) VALUES
(1, 'd32a357a-b4ee-40a9-a248-9ac53dca2ec3', 'کتاب صوتی هری پاتر و سنگ جادو جی کی رولینگ آوانامه', 'harry-potter-and-the-sorcerers-stone-audiobook-by-j-k-rowling-avaname', 'هری پاتر کیست؟\r\n\r\nهری پاتر، شخصیت اصلی داستان، پسر نوجوان یازده ساله‌ای است که در ابتدای داستان در کمد زیر پله خانه دورسلی‌ها زندگی می‌کند، خانواده‌ای که شامل خاله، شوهرخاله و پسرخاله‌ی هم سن و سال چاق و منفورش است. علیرغم تلاش دورسلی‌ها برای پنهان کردن هویت اصلی خانواده پاتر و استعدادهای جادوگری‌شان، بالاخره هری به دنیای جالب و پر از هیجان جادوگری، از جمله هاگوارتز، مدرسه جادوگری، راه پیدا می‌کند و در آنجا با دو دوست صمیمی خود، رون و هرمیون، آشنا می‌شود و دوران پر فراز و نشیبی را با چالش‌های فراوان سپری می‌کند؛ چالش‌هایی از جمله رویارویی با لرد ولدمورت که حتی بردن نامش بر اندام‌ها لرزه می‌اندازد. ولدمورت، جادوگر منحوس و پلیدی که افراد زیادی را به قتل رسانده، نتوانسته هری را در سن خردسالی از پا درآورد و تنها زخم صاعقه مانندی را بر روی پیشانی‌اش برجای گذاشته است. چنین است که هری پاتر به \"پسری که زنده ماند\" معروف شده است.\r\n\r\n\r\n\r\nجی.کی.رولینگ\r\n\r\nجوآن رولینگ، ملقب به جی.کی.رولینگ، نویسنده زن بریتانیایی این کتاب، توسط مجله تایم در سال 2007، بعد از ولادیمیر پوتین، به عنوان تأثیرگذارترین فرد سال انتخاب شد. او مدعی است ایده‌ی هری پاتر زمانی به ذهنش خطور کرده‌است که در ایستگاه قطار منتظر ایستاده بوده. نقطه قوت این اثر که آن را جزو پرفروش‌ترین کتاب‌های جهان کرده این است که به مخاطبان خود(چه نوجوان و چه بزرگسال) دنیای بسیار جذاب دیگر ولی «پنهان» را معرفی می‌کند که ممکن است هر کسی به آن تعلق داشته باشد.\r\n\r\n\r\n\r\nسنگ جادو\r\n\r\nجی.کی.رولینگ در هر یک از مجموعه کتاب‌های هری پاتر ماجراهای هر سال تحصیلی در هاگوارتز را روایت می‌کند که از تابستان و تعطیلات قبل از مدرسه شروع می‌شود و در انتهای سال تحصیلی آن را به پایان می‌رساند. هری پاتر و سنگ جادو که نام جلد اول این مجموعه است، شامل ماجرا‌ها و اتفاقاتی است که طی سال اول تحصیلی هری پاتر رخ می‌دهد. او با شجاعت خود و با کمک هوش هرمیون، وفاداری رون و خرد دامبلدور (مدیر مدرسه) می‌کوشد تا این سنگ جادو به دست افراد نادرست نیافتد.\r\n\r\n\r\n\r\nهری پاتر را بخوانیم، ببینیم و بشنویم!\r\n\r\nبا وجود جذابیت فراوان و پرطرفدار بودن فیلم‌های هری پاتر که توسط کمپانی برادران وارنر ساخته شده است، متوجه تفاوت‌هایی با متن کتاب می‌شویم. این تفاوت‌ها شامل حذف بعضی جزئیات و شخصیت‌ها و حتی بعضی ماجراها است که باعث شده اکثر طرفداران این مجموعه، داستان مکتوب را نسبت به فیلم‌های ساخته شده کامل‌تر، دقیق‌تر و جذاب‌تر بدانند. بنابراین با شنیدن مجموعه کتاب‌های صوتی هری پاتر علاوه بر اینکه از جزئیات باخبر خواهید شد بلکه می‌توانید با اجرای شنیدنی و نمایشی آرمان سلطان زاده همراه با افکت‌های صوتی و موسیقی، بیشتر درگیر غم‌ها و شادی‌ها و هیجانات شوید و و از داستان لذت بیشتر ببرید.', '/assets/images/books/harry-potter-and-the-sorcerers-stone-audiobook-by-j-k-rowling-avaname_1762290168.webp', 0, 1, 3, 4, 0.00, 1, 0, 1, 0, 0.00, NULL, '2025-11-04 21:02:48', '2025-11-04 21:02:48');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int NOT NULL,
  `parent_id` int DEFAULT NULL,
  `uuid` varchar(36) COLLATE utf8mb4_persian_ci NOT NULL,
  `name` varchar(100) COLLATE utf8mb4_persian_ci NOT NULL,
  `slug` varchar(100) COLLATE utf8mb4_persian_ci NOT NULL,
  `description` text COLLATE utf8mb4_persian_ci,
  `cover_image` varchar(255) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `color` varchar(7) COLLATE utf8mb4_persian_ci DEFAULT '#00BFA5',
  `is_active` tinyint(1) DEFAULT '1',
  `sort_order` int DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `parent_id`, `uuid`, `name`, `slug`, `description`, `cover_image`, `color`, `is_active`, `sort_order`, `created_at`) VALUES
(1, NULL, 'c6906be7-6534-4fdb-a63e-b7b1619af43a', 'کتاب صوتی', 'audiobooks', 'معرفی و دانلود بهترین کتاب‌های صوتی\r\nکتاب های صوتی راهی عالی برای لذت بردن از مطالعه در هر زمان و مکان هستند؛ چه در مسیر رفت‌وآمد، چه در هنگام ورزش یا استراحت. با خرید و دانلود کتاب گویا شنوا ، دنیایی از داستان‌ها و دانش در قالبی حرفه‌ای و با صدای گویندگان توانمند در اختیار شماست. اگر به دنبال تجربه‌ای متفاوت از خواندن هستید، شنیدن این کتاب صوتی را از دست ندهید!\r\nکتاب صوتی (کتاب گویا) چیست؟\r\nکتاب صوتی یا کتاب گویا، کتابی است که متن آن توسط یک یا چند گوینده خوانده شده و به صورت فایل صوتی در اختیار مخاطبان قرار می‌گیرد. دانلود کتاب های صوتی مفهوم جدیدی نیست، اما در سال‌های اخیر محبوبیت زیادی پیدا کرده است.\r\nیکی از مزایای کتابهای صوتی، راحتی و دسترسی آسان به آن است. کتاب گویا را می‌توان در هر زمان و مکانی شنید، بدون اینکه نیازی به حمل کتاب فیزیکی باشد. این امر به ویژه برای افرادی که فرصت زیادی برای مطالعه ندارند، بسیار مفید و کارآمد است.\r\nمزیت دیگر دانلود کتاب صوتی، امکان لذت بردن از کتاب در حین انجام کارهای دیگر است. کتاب های صوتی را می‌توان در حین رانندگی، ورزش یا کار منزل گوش داد. این امر باعث می‌شود که بتوان در زمان‌هایی که به طور معمول نمی‌توان مطالعه کرد، از خواندن کتاب‌هایی که دوستشان داریم لذت برد.\r\nانواع کتاب صوتی\r\nکتاب صوتی‌ها در انواع مختلفی موجود هستند، از جمله رمان، ادبیات، کودک و نوجوان، علمی، روانشناسی، سبک زندگی و مدیریت و بازاریابی. این امر باعث می‌شود که بتوان کتاب‌هایی را پیدا کرد که با علاقه‌های مختلف افراد مطابقت داشته باشد.\r\nکتاب های صوتی می‌تواند یک راه عالی برای یادگیری و سرگرمی باشد. اگر به دنبال یک راه جدید برای مطالعه هستید، کتاب گویا را امتحان کنید. در اینجا به چند نکته برای انتخاب و گوش دادن به کتاب صوتی اشاره می‌کنیم که ممکن است کیفیت خوانش صوتی آثار را بهبود بخشد:\r\nنخست اینکه به موضوع و ژانر کتاب توجه کنید. مطمئن شوید که کتابی را انتخاب می‌کنید که با علاقه‌های شما مطابقت داشته باشد. سپس به گوینده کتاب توجه کنید. گوینده کتاب باید صدایی واضح و گیرا داشته باشد و بتواند شخصیت‌های داستان را به خوبی به تصویر بکشد.\r\nمعرفی پرفروش ترین کتاب های صوتی\r\n شنوا  یکی از بزرگترین پلتفرم‌های کتابخوانی در ایران است که علاوه بر کتاب‌های متنی، کتاب گویا نیز در آن عرضه می‌شود.\r\nبرخی از بهترین کتاب های صوتی شنوا عبارتند از:\r\n•	سقوط اثر آلبر کامو، با صدای بهرام ابراهیمی\r\n•	هزار خورشید تابان اثر خالد حسینی، با صدای رضا عمرانی\r\n•	دختر که رهایش کردی اثر جوجو مویز، با صدای رضا عمرانی و راضیه هاشمی\r\n•	نسخه صوتی مغازه خودکشی با صدای هوتن شکیبا\r\n•	نسخه صوتی سمفونی مردگان با صدای حسین پاکدل\r\n•	نسخه صوتی کتابخانه نیمه شب با صدای جمعی از گویندگان\r\n•	نسخه صوتی یک عاشقانه آرام با صدای پیام دهکردی\r\nاین کتاب‌ها همگی از آثار پرفروش و محبوب هستند که توسط گویندگان حرفه‌ای اجرا شده‌اند.\r\nاگر به دنبال یک راه جدید برای مطالعه هستید، خرید کتاب گویا شنوا را امتحان کنید. مطمئناً از آن‌ها لذت خواهید برد.\r\nچرا کتابهای صوتی محبوب و پرطرفدار شده‌اند؟\r\nدر دنیای پرمشغله‌ی امروز، بسیاری از ما فرصت کافی برای نشستن و مطالعه‌ی کتاب نداریم. کتاب های صوتی با فراهم کردن امکان گوش دادن به محتوای ارزشمند در حین رانندگی، پیاده‌روی، ورزش یا کارهای روزمره، این مشکل را حل کرده‌اند.\r\nاز طرفی، روایت حرفه‌ای گویندگان باعث می‌شود تجربه‌ی شنیدن کتاب، لذت‌بخش‌تر و عمیق‌تر از خواندن سنتی باشد. تنوع بالای موضوعات، دسترسی آسان از طریق اپلیکیشن‌هایی مثل اپلیکیشن شنوا  و امکان یادگیری یا سرگرمی بدون نیاز به صفحه‌خوانی، از مهم‌ترین دلایل محبوبیت دانلود کتاب های صوتی هستند.\r\nکتاب صوتی مناسب چه کسانی است؟\r\nکتابهای صوتی انتخابی عالی برای افرادی است که در کنار دغدغه‌های روزمره، نمی‌خواهند از یادگیری یا لذت مطالعه عقب بمانند. اگر جزو یکی از گروه‌های زیر هستید، کتاب های صوتی دقیقاً برای شما ساخته شده‌اند:\r\n•	افراد پُرمشغله که وقت آزاد کمی برای مطالعه دارند\r\n•	دانشجویان و علاقه‌مندان به یادگیری که می‌خواهند از زمان‌های مرده‌شان بهترین استفاده را ببرند\r\n•	علاقه‌مندان به داستان و رمان که شنیدن روایت یک داستان را جذاب‌تر از خواندن آن می‌دانند\r\n•	افراد دارای اختلالات بینایی یا کسانی که خواندن برایشان سخت است\r\n•	کسانی که در حین رانندگی، ورزش یا کارهای روزمره می‌خواهند مطالعه کنند\r\nکتاب های صوتی، مطالعه را ساده، لذت‌بخش و در دسترس همه کرده‌اند — تنها با یک هدفون و چند دقیقه وقت آزاد.\r\nکتاب صوتی همان پادکست است؟\r\nخیر؛ کتاب صوتی و پادکست هرچند شباهت‌هایی دارند، اما دو قالب کاملاً متفاوت از محتوا هستند.\r\nکتابهای صوتی نسخه‌ای صوتی از یک کتاب مکتوب است که معمولاً با صدای گوینده حرفه‌ای و با رعایت ساختار کامل کتاب (فصل‌بندی، لحن نویسنده و...) ضبط می‌شود. این محتوا دقیقاً بازتاب وفادارانه‌ای از متن اصلی کتاب است.\r\nدر مقابل، پادکست بیشتر حالت گفت‌وگویی یا محتوای آزاد دارد و معمولاً موضوع‌محور است، نه متن‌محور. پادکست‌ها ممکن است جنبه خبری، تحلیلی، سرگرمی یا آموزشی داشته باشند و لزوماً مبتنی بر کتاب یا متن مشخصی نیستند.\r\nکتاب های صوتی را با صدای چه کسانی بشنویم؟\r\nیکی از جذاب‌ترین بخش‌های تجربه شنیدن و دانلود کتاب صوتی، صدای گوینده‌ای است که روح تازه‌ای به کلمات می‌بخشد. در شنوا ، کتاب های صوتی با صدای هنرمندان و گویندگان حرفه‌ای تولید می‌شوند که شنیدن صدای آن‌ها خود به‌تنهایی یک لذت است.\r\nاز جمله صدای گرم و متفاوت هوتن شکیبا، روایت دلنشین و هنرمندانه‌ی شرمین نادری، اجرای پرانرژی و تاثیرگذار آرمان سلطان‌زاده، صدای عمیق و ماندگار رضا عمرانی، صدای نوستالژیک بهرام شاه محمدلو، تا صدای خاص و منحصربه‌فرد محمود دولت‌آبادی که خود آثارش را روایت کرده است — همه و همه تجربه‌ای متفاوت از کتاب‌خوانی برایتان رقم خواهند زد.\r\nبا این صداها، کتاب شنیدن نه‌فقط آسان، بلکه به‌شدت لذت‌بخش می‌شود.\r\nدانلود کتابهای صوتی در شنوا\r\nشنوا یکی از بزرگ‌ترین و معتبرترین پلتفرم‌های کتاب الکترونیکی و صوتی در ایران است که با آرشیوی غنی از هزاران عنوان کتاب صوتی، تجربه‌ای جذاب و راحت از شنیدن کتاب را فراهم کرده است.\r\nبرای دانلود کتاب های صوتی در شنوا ، تنها کافی‌ست اپلیکیشن را روی گوشی یا تبلت خود نصب کنید، کتاب مورد نظرتان را جستجو کرده و با یک کلیک آن را به کتابخانه‌تان اضافه کنید.\r\nامکان دانلود برای شنیدن آفلاین، تنظیم سرعت پخش، و تایمر خواب از جمله امکانات ویژه‌ای هستند که شنوا برای لذت‌بخش‌تر کردن تجربه شنیدن کتاب در اختیار شما قرار داده است.\r\nچه به دنبال دانلود کتاب های صوتی رایگان باشید و چه آثار پرفروش نویسندگان مشهور، در شنوا همیشه چیزی برای گوش دادن وجود دارد.', '/assets/images/categories/audiobooks_1762279846.webp', '#00BFA5', 1, 0, '2025-11-04 18:10:46'),
(2, 1, '0ca0a7d9-6aea-42b8-9eff-92c5c3268b21', 'داستان و رمان', 'story', 'معرفی و دانلود بهترین کتاب‌های صوتی داستان و رمان\r\nچقدر به شنیدن کتاب‌های صوتی داستان و رمان علاقه‌مند هستید؟ تا‌به‌حال داستان و رمان را به صورت صوتی گوش داده‌اید؟ شما کدام یک را ترجیح می‌دهید؟ کتاب متنی یا صوتی؟ این روزها که سرانه مطالعات کشور به شدت پایین است و دیگر کسی سراغ کتاب نمی‌رود، سوق دادن نوجوانان به داستان‌ها و رمان‌های صوتی می‌تواند راهگشا باشد. بسیاری از نوجوانان تمایل به شنیدن فایل صوتی دارند تا خواندن متن. این البته منحصر به نوجوانان نیست و کسر قابل توجهی از گروه‌های سنی دیگر نیز این‌طور فکر می‌کنند. مهم‌ترین مزیت خرید کتاب‌های داستان و رمان صوتی این است که می‌توان در طول روز در کنار دیگر کارها به آن گوش فرا داد. \r\n مزیت‌های کتاب صوتی آن‌قدری است که اگر یک بار آن را امتحان کنید، احتمالا طرفدار آن خواهید شد. پس همین حالا شروع کنید و کتاب صوتی مورد علاقه خود را از شنوا دانلود کنید. ما در این مطلب تعدادی از بهترین کتاب‌های داستان و رمان صوتی را که می‌توانید از شنوا تهیه کنید، به شما معرفی خواهیم کرد.\r\n\r\nمعرفی کتاب‌های صوتی پرفروش داستان و رمان \r\nآثار فوق‌العاده جذاب و دلنشین هوشنگ مرادی کرمانی همچون داستان‌های ماندگار قصه‌های مجید و مربای شیرین از جمله پرفروش‌ترین کتاب‌های داستان حوزه نوجوان است. مرادی کرمانی با خلق آثار دلنشینش یکی از برترین نویسندگان تاریخ معاصر است. شما می‎توانید این کتاب‌های صوتی را از شنوا دانلود کنید.\r\nداستان‌های علمی تخیلی و در راس آن ماجراهای هری پاتر در نسل نوجوان فعلی مخاطب بسیاری دارد. در این بین کتاب‌های صوتی هری پاتر و حفره اسرار آمیز و هری پاتر و محفل ققنوس از کتاب‌هایی هستند که مخاطبان شنوا بسیار از آن استقبال کرده‌اند. شما می‌توانید با مراجعه به اپلیکیشن و یا سایت شنوا این کتاب صوتی را بشنوید.\r\nدیگر کتاب صوتی پرفروش داستان و رمان که به شما توصیه می‌کنیم شاهکار آنتوان دوسنت اگزوپری یعنی شازده کوچولو است. این کتاب که نخستین بار سال 1943 منتشر شده از پرتیراژترین کتاب‌های تاریخ است. فایل صوتی رمان شازده کوچولو در شنوا در دسترس است.\r\n\r\nدانلود کتاب‌های پرطرفدار داستان و رمان صوتی\r\nیکی از کتاب‌های پرطرفدار حوزه نوجوان داستان ماشالله خان و بارگاه هارون‌الرشید است. کتابی که اگرچه برای رده سنی نوجوان نوشته شده اما به اعتقاد نویسنده برجسته آن، ایرج پزشکزاد احتمالا افراد سالخورده هم از آن لذت ببرند. شما می‌توانید این کتاب پرطرفدار را از سایت شنوا به‌صورت صوتی تهیه کنید.\r\nکتاب زنان کوچک اثر به‌یادماندنی لوئیزا می اوکالت در اواسط قرن 19 میلادی نوشته شده است. این رمان الهام‌بخش بعد از این همه سال همچنان یکی از کتاب‌های پرطرفدار در دنیا است. برای تهیه این کتاب صوتی شما می‌توانید از سایت شنوا بازدید کنید.  در بین همه آثار مارک تواین، نویسنده شهیر آمریکایی، داستان شاهزاده و گدا از محبوب‌ترین کتاب‌های اوست. کتابی که بارها در سراسر جهان تجدید چاپ شده و به زبان‌های مختلف ترجمه شده است. این کتاب روایتی از دوستی پسری فقیر با یک شاهزاده است. در این اثر هر دو نفر به جایگاه یکدیگر غبطه می‌خورند و همین امر باعث داستان‌های جالبی برای این دو می‌شود. گوش‌دادن به این کتاب صوتی در اپلیکیشن رایگان شنوا امکان‌پذیر است.', '/assets/images/categories/story_1762281238.jpg', '#00bfa5', 1, 0, '2025-11-04 18:33:58'),
(3, 1, '05ca78b9-ff47-4be8-a393-bc79aa1497ea', 'داستان و رمان خارجی', 'story-foreign', 'معرفی و دانلود بهترین کتاب‌های صوتی داستان و رمان خارجی\r\nخرید و دانلود بهترین کتاب‌های صوتی داستان و رمان خارجی\r\nبیایید باهم یک سفر پرماجرا به دنیای کتاب‌های صوتی داستان و رمان خارجی کنیم. در این دنیای جادویی شما با شخصیت‌های جذاب و ماجراهای متنوع آشنا خواهید شد. هر گامی که برداشته و هر صفحه‌ای که برگردانده می‌شود، به ماجراهای جدیدی خواهید رسید و در دنیایی کاملاً جدید فرو خواهید رفت. این سفر ماجراجویانه پر از هیجان و شگفتی‌های بی‌پایان است که شمارا به دنیایی خارق‌العاده می‌برد. از دیدن شگفتی‌ها و تجربه‌ی لحظات هیجان‌انگیز لذت می‌برید.\r\nداستان‌ها و رمان‌های خارجی شامل داستان‌هایی از جهات و فرهنگ‌های مختلف هستند که می‌توانند خواننده را به دنیایی جدید و متفاوت ببرند. این آثار معمولاً توسط نویسندگان مطرحی نوشته می‌شود که با استفاده از سبک‌ها و روایت‌های متنوع خواننده را به دنیای خود می‌کشانند و احساسات مختلفی را در آن‌ها به تصویر می‌کشند. بهترین کتاب‌های صوتی داستان و رمان خارجی شامل داستان‌های متنوعی در ژانرهای مختلفی مانند رمان عاشقانه، علمی-تخیلی، جنایی، فانتزی و غیره است. شما می‌توانید از طریق شنوا بهترین کتاب‌های صوتی داستان و رمان خارجی را دانلود کنید و از شنیدن آن‌ها نهایت لذت را ببرید.\r\nمعرفی کتاب‌های پرفروش صوتی داستان و رمان خارجی\r\nاستفاده از بهترین کتاب‌های صوتی داستان و رمان خارجی به‌جای رمان‌های کاغذی امکانات بیشتری را به شما ارائه می‌دهد. با گوش دادن به رمان‌های صوتی، شما نیازی به حمل کتاب کاغذی ندارید و می‌توانید همیشه کتاب صوتی خود را در دسترس داشته باشید. درجاهایی که امکان مطالعه کتاب ممکن نیست مانند رانندگی، ورزش کردن و غیره می‌توانید از طریق گوش دادن ادامه رمان خود را پیگیری کنید.\r\n گوش دادن به رمان‌های صوتی به بهبود مهارت‌های شنیداری شما کمک می‌کند. شما با گوش دادن به داستان‌ها و متن‌های مختلف با لغات و اصطلاحات جدید آشنا خواهید شد. از طرف دیگر، برخی رمان‌های صوتی با استفاده از اثرات صوتی، صداها و نقش‌آفرینی‌های متنوع تجربه‌ای جذاب و واقعی‌تر از داستان را به خواننده ارائه می‌دهند. رمان‌های صوتی به‌عنوان یک گزینه مدرن و جذاب تجربهٔ مطالعه را برای خواننده بهتر می‌کنند و امکانات جدیدی را در اختیار آن‌ها قرار می‌دهند که موجب صرفه‌جویی در وقت و هزینه آن‌ها می‌شود. از حمله نمونه‌های پرفروش کتاب‌های صوتی داستان و رمان خارجی می‌توان به موارد زیر اشاره کرد.\r\n\r\n· کتاب صوتی سقوط اثر آلبرکامو\r\n·کتاب صوتی شرط بندی اثر آنتون چخوف\r\n· کتاب صوتی کیمیاگر اثر پائولو کوئیلو\r\n· کتاب صوتی پیرمرد و دریا اثر ارنست همینگوی\r\n· کتاب صوتی ملت عشق اثرالیف شافاک\r\n·کتاب صوتی وقتی نیچه گریست اثر اروین یالوم\r\n\r\nدانلود کتاب‌های رایگان صوتی داستان و رمان خارجی\r\nخواندن رمان‌ها یک فعالیت سرگرم‌کننده و آموزنده است. این فعالیت نه‌تنها برای سرگرمی و لذت بردن انجام می‌شود، بلکه به شما امکان می‌دهد تا در زمینه‌های مختلفی ازجمله زبان، تاریخ، فرهنگ، روانشناسی و دیگر موضوعات علمی و فرهنگی دانش و آگاهی خود را گسترش دهید. گوش دادن به رمان باعث تقویت مهارت‌های ذهنی شما نیز می‌شود؛ زیرا خواندن رمان‌ها نیازمند تمرکز، تفکر، حافظه و تخیل است.\r\nهنگامی‌که شما با یک داستان جذاب و شخصیت‌های دل‌نشین آن آشنا می‌شوید، می‌توانید با قوه تخیل خود به دنیای‌ جدیدی که در داستان مطرح می‌شود، فرو بروید. این تجربه، علاوه بر اینکه برای لذت بردن و سرگرمی است به افزایش قدرت تخیل و خلاقیت شما نیز کمک می‌کند. وقتی‌که شما با داستان و شخصیت‌های جذاب یک رمان سرگرم هستید، به استرس‌های روزمره خود کمتر فرصت فکر کردن دارید که نقش مهمی در تقویت روحیه شما دارد. خواندن کتاب‌های صوتی داستان و رمان خارجی نه‌تنها یک سرگرمی است بلکه یک تجربه آموزنده و مفید منتقل می‌کند. شنوا به‌منظور کسب رضایت مخاطبان خود اقدام به ارائه‌ی برخی از کتاب‌های صوتی داستان و رمان خارجی به‌صورت رایگان کرده است. برای دانلود کتاب صوتی داستان خارجی می‌توانید از طریق شنوا اقدام کنید.\r\n\r\n·کتاب صوتی رایگان پاسیو مشترک نویسنده میراندا جولای\r\n·کتاب صوتی رایگان سکوت نویسنده ادگار آلن‌پو\r\n·کتاب صوتی سوظن نویسنده ادگار والاس\r\n·کتاب صوتی رایگان استعفای باشکوه نویسنده میچی ان جی\r\n·کتاب صوتی رایگان پلیدی نویسنده کریستین بوبن\r\n· کتاب صوتی رایگان پدر جودی آشغال است نویسنده ماتسو لیچت', '/assets/images/categories/story-foreign_1762281295.jpg', '#00BFA5', 1, 0, '2025-11-04 18:34:55'),
(4, 1, 'b6619193-4b02-4797-9445-d7fea1467d5e', 'فانتزی', 'story-foreign-fantasy', 'معرفی و دانلود بهترین کتاب‌های صوتی داستان و رمان فانتزی خارجی\r\nخرید و دانلود کتاب‌های صوتی داستان و رمان فانتزی\r\n\r\nادبیات دریایی از ژانرهای متنوع است که هرکدام خوانندگان خاص خود را دارند. در میان این ژانرها، فانتزی با جذابیت بی‌نظیرش، طیف وسیعی از مخاطبان را در هر سنی به خود جذب می‌کند.\r\n\r\nدر دنیای فانتزی، نویسنده با تلفیق اساطیر، افسانه‌ها و عناصر دنیای واقعی، دریچه‌ای به سوی تجربه‌ای متفاوت می‌گشاید. داستان‌هایی که غالباً فراتر از درک عادی بشر هستند و با وجود پرداختن به مسائل دنیای واقعی، مسیر حل مسئله و روند داستان را به گونه‌ای غیرمعمول و جذاب روایت می‌کنند. اگر به دنبال لذتی منحصر به فرد در مطالعه هستید، قفسه کتاب‌های فانتزی منتظر شماست تا با دنیایی سرشار از شگفتی و تخیل روبرو شوید. کتابهای فانتزی صوتی در دوران‌ معاصر بسیار مورد توجه مخاطبان فارسی قرار گرفته و ناشران صوتی زیادی شروع به تولید کتاب‌های صوتی فانتزی کرده‌اند.\r\n\r\n\r\n\r\nتاریخچه‌ای کوتاه از کتابهای فانتزی\r\n\r\n\r\nریشه‌های فانتزی به داستان‌های هزار و یک شب (حدود 700 تا 1500 سال پیش) بازمی‌گردد و کم کم به پیش آمده تا به مجموعه‌های شگفتی چون ارباب حلقه‌ها رسیده است. در جهان کتاب‌های فانتزی نقطه عطف‌های زیادی داشته که قطعا یکی از مهم‌ترین آنها ارباب حلقه‌هاست.\r\n\r\nانتشار این کتاب اثر جورج آر.آر. تالکین در قرن بیستم، نگاه دنیا به فانتزی را دگرگون کرد و مسیر را برای خلق آثار ماندگار دیگر هموار نمود.\r\n\r\nاز آن زمان، موجودات عجیب و غریب، افسانه‌ها، شمشیرهای جادویی، وردهای خاص و دنیای شگفت‌انگیز آمیخته با واقعیت، به عنصری محبوب در ژانر فانتزی تبدیل شدند.\r\n\r\nامروزه شاهد آثار فانتزی بی‌نظیری در سراسر جهان هستیم و بسیاری از فیلم‌های پرفروش نیز بر اساس این ژانر ساخته می‌شوند.\r\n\r\n\r\n\r\nچرا گوش دادن به کتابهای فانتزی جذاب است؟\r\n\r\nگوش دادن به داستان‌های فانتزی حال و هوای متفاوتی دارد چون از مرزهای تخیل و تصور بسیار فراتر رفته و در دنیای خیالات بی‌انتها قدم می‌گذاریم. در حال حاضر ناشران صوتی با استفاده از صداپیشگان با سابقه رادیو این کتاب‌ها را به صورت گروهی و در پروژه‌های بزرگ تولید می‌کنند.\r\n\r\n\r\n\r\nپرفروش‌ترین کتاب‌های صوتی فانتزی\r\nدر میان کتاب‌های صوتی فانتزی تاکنون کتاب‌های زیادی منتشر شده که بسیاری از آنها با استقبال زیاد مخاطبان روبرو شده است. از میان به پنج کتاب صوتی پرفروش فانتزی را به شما معرفی می‌کنیم:\r\n\r\nکتاب صوتی ارباب حلقه‌ها\r\nکتاب صوتی هری پاتر و محفل ققنوس\r\nکتاب صوتی کوری\r\nکتاب صوتی تلماسه\r\nکتاب صوتی 1984', '/assets/images/categories/story-foreign-fantasy_1762281368.jpg', '#00BFA5', 1, 0, '2025-11-04 18:36:08');

-- --------------------------------------------------------

--
-- Table structure for table `chapters`
--

CREATE TABLE `chapters` (
  `id` int NOT NULL,
  `uuid` varchar(36) COLLATE utf8mb4_persian_ci NOT NULL,
  `book_id` int NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_persian_ci NOT NULL,
  `chapter_number` int NOT NULL,
  `audio_url` varchar(255) COLLATE utf8mb4_persian_ci NOT NULL,
  `duration` int NOT NULL,
  `file_size` bigint DEFAULT '0',
  `plays_count` int DEFAULT '0',
  `is_free` tinyint(1) DEFAULT '1',
  `sort_order` int DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `chapters`
--

INSERT INTO `chapters` (`id`, `uuid`, `book_id`, `title`, `chapter_number`, `audio_url`, `duration`, `file_size`, `plays_count`, `is_free`, `sort_order`, `created_at`) VALUES
(1, '3105e863-1859-4564-9371-b0adeef21bcd', 1, 'فصل اول: پسری که زنده ماند', 1, '/assets/audio/book_1_chapter_1_1762290535.mp3', 2340, 37982076, 0, 1, 1, '2025-11-04 21:08:55');

-- --------------------------------------------------------

--
-- Table structure for table `listening_history`
--

CREATE TABLE `listening_history` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `chapter_id` int NOT NULL,
  `book_id` int NOT NULL,
  `progress_seconds` int DEFAULT '0',
  `percentage` decimal(5,2) DEFAULT '0.00',
  `completed` tinyint(1) DEFAULT '0',
  `last_listened_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `reviews`
--

CREATE TABLE `reviews` (
  `id` int NOT NULL,
  `uuid` varchar(36) COLLATE utf8mb4_persian_ci NOT NULL,
  `user_id` int NOT NULL,
  `book_id` int NOT NULL,
  `rating` int NOT NULL,
  `title` varchar(200) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `comment` text COLLATE utf8mb4_persian_ci,
  `is_approved` tinyint(1) DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `uuid` varchar(36) COLLATE utf8mb4_persian_ci NOT NULL,
  `username` varchar(50) COLLATE utf8mb4_persian_ci NOT NULL,
  `email` varchar(100) COLLATE utf8mb4_persian_ci NOT NULL,
  `password_hash` varchar(255) COLLATE utf8mb4_persian_ci NOT NULL,
  `display_name` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `avatar_url` varchar(255) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `is_premium` tinyint(1) DEFAULT '0',
  `dark_mode` tinyint(1) DEFAULT '0',
  `sleep_timer_enabled` tinyint(1) DEFAULT '0',
  `sleep_timer_duration` int DEFAULT '0',
  `driving_mode` tinyint(1) DEFAULT '0',
  `last_login` datetime DEFAULT NULL,
  `last_login_at` datetime DEFAULT NULL,
  `login_count` int DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `uuid`, `username`, `email`, `password_hash`, `display_name`, `avatar_url`, `is_active`, `is_premium`, `dark_mode`, `sleep_timer_enabled`, `sleep_timer_duration`, `driving_mode`, `last_login`, `last_login_at`, `login_count`, `created_at`, `updated_at`) VALUES
(1, 'a4d5b071-8f51-4b31-b6e7-a6427fec3c94', 'admin', 'info@test.com', '$2y$10$.E/Ga3VESUA8iQfyR3xINegKCf6CrtWN8BejWdteAPozJGTGS/Dha', 'شایان نماینده', NULL, 1, 1, 1, 0, 0, 0, '2025-11-04 20:55:49', '2025-11-04 23:21:25', 2, '2025-11-04 16:53:24', '2025-11-04 21:43:03');

-- --------------------------------------------------------

--
-- Table structure for table `user_favorites`
--

CREATE TABLE `user_favorites` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `book_id` int NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `app_settings`
--
ALTER TABLE `app_settings`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `setting_key` (`setting_key`);

--
-- Indexes for table `authors`
--
ALTER TABLE `authors`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uuid` (`uuid`);

--
-- Indexes for table `bookmarks`
--
ALTER TABLE `bookmarks`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uuid` (`uuid`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `chapter_id` (`chapter_id`);

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uuid` (`uuid`),
  ADD UNIQUE KEY `slug` (`slug`),
  ADD KEY `author_id` (`author_id`),
  ADD KEY `narrator_id` (`narrator_id`),
  ADD KEY `category_id` (`category_id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uuid` (`uuid`),
  ADD UNIQUE KEY `slug` (`slug`),
  ADD KEY `parent_id` (`parent_id`);

--
-- Indexes for table `chapters`
--
ALTER TABLE `chapters`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uuid` (`uuid`),
  ADD KEY `idx_book_order` (`book_id`,`sort_order`);

--
-- Indexes for table `listening_history`
--
ALTER TABLE `listening_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chapter_id` (`chapter_id`),
  ADD KEY `book_id` (`book_id`),
  ADD KEY `idx_user_listening` (`user_id`,`last_listened_at`);

--
-- Indexes for table `reviews`
--
ALTER TABLE `reviews`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uuid` (`uuid`),
  ADD UNIQUE KEY `unique_user_book_review` (`user_id`,`book_id`),
  ADD KEY `book_id` (`book_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uuid` (`uuid`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Indexes for table `user_favorites`
--
ALTER TABLE `user_favorites`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_user_book` (`user_id`,`book_id`),
  ADD KEY `book_id` (`book_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `app_settings`
--
ALTER TABLE `app_settings`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `authors`
--
ALTER TABLE `authors`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `bookmarks`
--
ALTER TABLE `bookmarks`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `chapters`
--
ALTER TABLE `chapters`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `listening_history`
--
ALTER TABLE `listening_history`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `reviews`
--
ALTER TABLE `reviews`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `user_favorites`
--
ALTER TABLE `user_favorites`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `bookmarks`
--
ALTER TABLE `bookmarks`
  ADD CONSTRAINT `bookmarks_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `bookmarks_ibfk_2` FOREIGN KEY (`chapter_id`) REFERENCES `chapters` (`id`);

--
-- Constraints for table `books`
--
ALTER TABLE `books`
  ADD CONSTRAINT `books_ibfk_1` FOREIGN KEY (`author_id`) REFERENCES `authors` (`id`),
  ADD CONSTRAINT `books_ibfk_2` FOREIGN KEY (`narrator_id`) REFERENCES `authors` (`id`),
  ADD CONSTRAINT `books_ibfk_3` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`);

--
-- Constraints for table `categories`
--
ALTER TABLE `categories`
  ADD CONSTRAINT `categories_ibfk_1` FOREIGN KEY (`parent_id`) REFERENCES `categories` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `chapters`
--
ALTER TABLE `chapters`
  ADD CONSTRAINT `chapters_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `listening_history`
--
ALTER TABLE `listening_history`
  ADD CONSTRAINT `listening_history_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `listening_history_ibfk_2` FOREIGN KEY (`chapter_id`) REFERENCES `chapters` (`id`),
  ADD CONSTRAINT `listening_history_ibfk_3` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`);

--
-- Constraints for table `reviews`
--
ALTER TABLE `reviews`
  ADD CONSTRAINT `reviews_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `reviews_ibfk_2` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `user_favorites`
--
ALTER TABLE `user_favorites`
  ADD CONSTRAINT `user_favorites_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `user_favorites_ibfk_2` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
